# கணநாயகனே கருணாகரனே

*Artist:* K.Veeramani
*Date:* 2026-01-30

கணநாயகனே கருணாகரனே

சங்கரன் புதல்வா சக்தி விநாயகா
சங்கடங்கள் தீர்க்கும் சண்முக சோதரா
மங்கள நாயக மலர் அடி பணிதேன்
கணநாயகனே கருணாகரனே
குணுவர்ணிதியே குருவே சரணம்
கணநாயகனே கருணாகரனே

மணியும் நீயே ஒளியும் நீயே
மனமும் நீயே மலரும் நீயே
மணியும் நீயே ஒளியும் நீயே
மனமும் நீயே மலரும் நீயே

கணநாயகனே கருணாகரனே
குணுவர்ணிதியே குருவே சரணம்
கணநாயகனே கருணாகரனே

அரசும் வேம்பும் அமைந்த இடந்தனை
அமரும் இடமைக் கொண்டவனே
அரசும் வேம்பும் அமைந்த இடந்தனை
அமரம் இடமைக் கொண்டவனே
அனுதினம் பணிதேன், ஆடியேர் இடர் தீர்ப்பாய்
அமரர் நாயகனே அரணின் மைந்தனே
அனுதினம் பணிதேன், ஆடியேர் இடர் தீர்ப்பாய்
அமரர் நாயகனே அரணின் மைந்தனே

கணநாயகனே கருணாகரனே
குணுவர்ணிதியே குருவே சரணம்
கணநாயகனே கருணாகரனே
